{
    "greeting": "Привет, я Ильгиз",
    "description": "Я фронтенд-разработчик с опытом работы на React, Node.js, TypeScript и другими современными технологиями.",
    "view_portfolio": "Посмотреть мои работы",
    "about_me_title": "Обо мне",
    "about_me_intro": "Привет! Меня зовут Ильгиз, я фронтенд-разработчик с двухлетним опытом работы в веб-разработке. Я занимаюсь созданием удобных и красивых интерфейсов, используя HTML, CSS и JavaScript. В своей работе активно применяю React и TypeScript, а также Tailwind CSS для быстрой и эффективной разработки.",
    "about_me_backend": "На бэкенде я работаю с Node.js и Express, создавая REST API для поддержки фронтенд-приложений. Такой подход позволяет мне понимать и управлять всей системой проекта, обеспечивая её стабильную и надёжную работу.",
    "about_me_design": "Кроме кодинга, я уже четыре года занимаюсь дизайном и 3D-моделированием. В этом мне помогают инструменты, такие как Figma, пакет программ от Adobe, а также Blender 3D. Эти навыки позволяют мне создавать интерфейсы, которые не только функциональны, но и визуально привлекательны.",
    "about_me_conclusion": "Мне нравится объединять технические знания и дизайн, чтобы проекты были удобными и эстетически приятными для пользователей. Я всегда открыт к новым идеям и считаю, что хорошее общение — основа успешного проекта. Постоянно учусь и ищу способы улучшить свои навыки.",
    "skills_title": "Навыки",
    "frontend_title": "Frontend",
    "frontend_skills": {
        "html_css_js": "HTML, CSS, JavaScript",
        "react_ts": "React, TypeScript",
        "tailwind": "Tailwind CSS"
        },
        "backend_title": "Backend",
        "backend_skills": {
            "node_express": "Node.js, Express",
            "rest_api": "REST API"
        },
        "design_title": "Дизайн и 3D",
        "design_skills": {
            "figma_adobe": "Figma, Adobe Creative Suite",
            "blender": "Blender 3D"
        },
    "project_title_maxis": "Оптовый магазин одежды МАХИС",
    "role": "Роль: Ведущий фронтенд-разработчик и UI/UX-дизайнер",
    "role_description": "Описание роли:",
    "description-project-maxis": [
        "Создание адаптивного и интуитивно понятного интерфейса магазина с использованием технологий HTML, CSS, и JavaScript, обеспечивающего беспрепятственный пользовательский опыт на различных устройствах.",
        "Дизайн всех основных страниц магазина, включая каталог продукции, корзину, процесс оформления заказа и личный кабинет клиента.",
        "Взаимодействие с backend-разработчиками для интеграции API и обеспечения бесперебойного обмена данными между клиентской частью и сервером.",
        "Оптимизация запросов и работы с данными для улучшения производительности и скорости загрузки страниц.",
        "Разработка и стилизация интерфейса с использованием React и Tailwind CSS для достижения высокой производительности и удобочитаемого кода.",
        "Реализация динамических функций на сайте, таких как фильтрация, сортировка и поиск товаров в режиме реального времени с использованием JavaScript и React.",
        "Проведение исследований пользовательского опыта и создание интерактивных прототипов в Figma для тестирования и улучшения интерфейса.",
        "Разработка фирменного стиля и визуального оформления магазина, включая работу с цветовой палитрой, типографикой и иконографикой.",
        "Проведение кросс-браузерного и кросс-платформенного тестирования для обеспечения корректного отображения и функциональности на всех типах устройств.",
        "Оптимизация кода и ассетов для минимизации времени загрузки страниц и улучшения пользовательского опыта.",
        "Проект не был окончен, заказчик в последний момент отказался оплачивать работу, потому демонстрирую предрелизную версию, которая требует правок."
    ],
    
    "project_title_timer": "CodingTimer",
    "description_project_timer": "CodingTimer — это удобный инструмент для разработчиков, созданный с целью отслеживания времени, затраченного на изучение различных инструментов и языков фронтенд-разработки. Этот проект идеально подходит для тех, кто хочет вести учет своих учебных часов и анализировать, как они распределяются между разными технологиями.",
    "functionality_title_timer": "Функциональность:",
    "functionality_list_timer": [
        "Запоминание данных: система сохраняет введенные данные, что позволяет пользователям продолжать отслеживать свои результаты даже после закрытия приложения.",
        "Поддержка популярных языков: возможность выбора из предустановленных языков программирования или добавление собственного.",
        "Аналитика времени: приложение ведет учет количества часов, потраченных на изучение каждого языка программирования ежедневно и в целом.",
        "Визуализация данных: приложение использует Charts.js для создания наглядных графиков."
    ],
    "future_plans_timer": "Планы на будущее:",
    "future_plans_description_timer": "Добавление многоязычной поддержки и встроенного таймера для отслеживания времени в реальном времени.",
    "technologies_title_timer": "Технологии:",
    "technologies_list_timer": "HTML, CSS, JavaScript, Charts.js"

}